https://github.com/netology-code/javaqa-homeworks/tree/master/programming

Задача №1 - Money Transfer
Легенда
Вы устроились на работу в достаточно крупный банк и там произошёл неприятный казус: при пополнении счёта VIP-клиента что-то пошло не так.

Входные данные:

текущий баланс счёта клиента - переменная типа int, значение - 2_000_000_000 (два миллиарда рублей)*
сумма перевода - переменная типа int, значение - 500_000_000 (пятьсот миллионов рублей)
переменная для хранения итогового значения - тип int
Примечание*: Java позволяет для удобочитаемости использовать символ нижнего подчёркивания в числах.

Что вам нужно:

Создать базовое приложение (на основании примера, который рассматривался на лекции), позволяющее воспроизвести ситуацию*
Проанализировать ситуацию (а конкретно то, что записалось в переменной для хранения итогового значения)
Подготовить баг-репорт, в котором нормально описать, что же произошло
Важно: в причинах (почему именно так произошло) разбираться не нужно - мы об этом поговорим на лекции.

Примечание*: к сожалению, как всегда, все говорят, что что-то пошло не так, но никто не может объяснить толком, поэтому придётся разбираться вам.

Подготовьте отчёт о проведённом тестировании в указанном формате и разместите его в репозитории.

Подсказка
Итого: у вас должен быть репозиторий на GitHub, в котором расположен ваш Java-код, а также отчёт о проведённом тестировании и заведены баг-репорты в Issues (если баги есть).

Задача №2 - Precision
Легенда
Вы работаете в компании, развивающей бонусную систему для своих клиентов.

И так случилось, что в целях продвижения компании было решено внедрить дополнительный бонус новым клиентам.

Для этого программисты "по-быстрому" написали следующий кусок кода:

public class Main {
public static void main(String[] args) {
double regularBonus = 0.3;
double specialBonus = 0.6;
double totalBonus = regularBonus + specialBonus;
System.out.println(totalBonus);
}
}
Что вам нужно:

Создать базовое приложение и разместить в нём переданный вам код
Проверить его работоспособность (данные менять не нужно)
Подготовьте отчёт о проведённом тестировании в указанном формате и разместите его в репозитории.

Важно: в причинах (почему именно так произошло) разбираться не нужно - мы об этом поговорим на лекции.

Итого: у вас должен быть репозиторий на GitHub, в котором расположен ваш Java-код, а также отчёт о проведённом тестировании и заведены баг-репорты в Issues (если баги есть).